{
   "description":"WHAT MAKES US EPIC?   \n  \nAt the core of Epic’s success are talented, passionate people. Epic prides itself on creating a collaborative, welcoming, and creative environment. Whether it’s building award-winning games or crafting engine technology that enables others to make visually stunning interactive experiences, we’re always innovating.   \n  \nBeing Epic means being a part of a team that continually strives to do right by our community and users. We’re constantly innovating to raise the bar of engine and game development.   \n  \nENGINEERING   \n  \n**What We Do  \n  \n** Unreal projects have been leading the pack of real-time entertainment with our constantly growing team of engineering experts. We’re always improving on the tools and technology that empower content developers worldwide.   \n  \n**What You'll Do  \n  \n** Epic Games is looking for an experienced Gameplay/ AI Programmer to join the Fortnite AI team. We believe that the best gameplay experiences are driven by collaboration and iteration between gameplay programmers, designers, and artists. You will play a critical role in driving future gameplay AI features in Fortnite.   \n  \n**In this role, you will  \n  \n**\n  * Work closely with art and design to create and iterate on gameplay AI features\n  * Experiment with game design and use rapid prototyping while ensuring that strong architectural and algorithmic decisions are made\n  * Drive, build and maintain core AI systems in Fortnite AI ecosystem\n  * Collaborate with engine AI developers to improve AI systems\n  * Ensure high quality user experiences across all platforms we support\n  * Optimize and fix bugs in existing gameplay AI systems  \n  \n  \n\n\n**What We’re Looking For  \n  \n**\n  * Experience developing games professionally, and shipping AAA titles with AI experience \n  * Experience working with AI systems (Behavior Trees, Finite State Machine, Pathfinding, etc.)\n  * Strong C++ skills and the ability to code and architect AI gameplay mechanics and tools \n  * Well versed in game’s and the ability to articulate what is strong/weak about the design of existing games (an interest in online games is preferred)\n  * Excellent communication and interpersonal skills\n  * Console experience\n  * Experience working on a live service game is a plus\n  * Self-motivated, strong work ethic, and able to work independently\n  * Creativity in problem-solving and the ability to think outside of the established solutions  \n  \n  \n\n\n**This role is open to multiple locations across North America** **(including CA, NYC, and WA).  \n  \n** Pay Transparency Information   \n  \nThe expected annual base pay range(s) for this position are detailed below. Each base pay range is relevant only for individuals who are residents of or will be expected to work within the specified locale. Compensation varies based on a variety of factors, which include (but aren’t limited to) things such as skills and competencies, qualifications, knowledge, and experience. In addition to base pay, most employees are eligible to participate in Epic’s generous benefit plans and discretionary incentive programs (subject to the terms of those plans or programs).   \n  \nBritish Columbia Base Pay Range   \n  \n$188,645—$276,680 CAD   \n  \n**About Us  \n  \n** Epic Games spans across 19 countries with 55 studios and 4,500+ employees globally. For over 25 years, we’ve been making award-winning games and engine technology that empowers others to make visually stunning games and 3D content that bring environments to life like never before. Epic’s award-winning Unreal Engine technology not only provides game developers the ability to build high-fidelity, interactive experiences for PC, console, mobile, and VR, it is also a tool being embraced by content creators across a variety of industries such as media and entertainment, automotive, and architectural design. As we continue to build our Engine technology and develop remarkable games, we strive to build teams of world-class talent.   \n  \n**Like what you hear? Come be a part of something Epic!  \n  \n** Epic Games deeply values diverse teams and an inclusive work culture, and we are proud to be an Equal Opportunity employer. Learn more about our Equal Employment Opportunity (EEO) Policy here.   \n  \n**Note to Recruitment Agencies:** Epic does not accept any unsolicited resumes or approaches from any unauthorized third party (including recruitment or placement agencies) (i.e., a third party with whom we do not have a negotiated and validly executed agreement). We will not pay any fees to any unauthorized third party. Further details on these matters can be found here. \n",
   "industry":[
      "Computer Games, Software Development, and Entertainment Providers"
   ],
   "company_name":"Epic Games",
   "title":"Senior AI Programmer, Fortnite"
}